README.org
* Erica's Emacs
:PROPERTIES:
:CUSTOM_ID: ericas-emacs
:END:
A simple straight forward  /emacs.d/ with /init.el/ configuration that uses packages. No /use-package/, just
elpa, some config files and some extensions outside of elpa.

This is a semi-literate configuration. All code from the *root* and *early-packages/* folder is tangled from the
source blocks in this document. The rest of the code is in the /extensions/ and /config/ directories.
/Extensions/ is where package-less code with no home goes.  The /config/ directory has -conf.el files for
everything that needs one.

Here are some of the things that I do in and with emacs.

Coding, creative and technical writing, language learning, website publishing, tango teacher, tango DJ, musician,
time clocking, invoicing, scheduling, email, note taking, epub reading, comic reading, file managing,
and window managing.  I know I've forgotten things.

** Installation
:PROPERTIES:
:CUSTOM_ID: installation
:END:
I use Emacsn now with Chemacs2. I wouldn't want to manage my emacs the
hard way again.  Emacsn makes Chemacs2 easy.

*** Using Emacsn with Chemacs2
:PROPERTIES:
:CUSTOM_ID: emacsn---chemacs2
:END:
Go to the [[https://github.com/ericalinag/Emacsn][Emacsn]] repo and follow the directions there, this flavor of Emacs
is the default and one of many to choose from. Emacsn allows us install along
side other configurations, and to also keep dev, stable and test images,
of our Emacs.

*** Emacs.d - Clone -> ~/.emacs.d The hard way ???
:PROPERTIES:
:CUSTOM_ID: clone---.emacs.d-the-hard-way
:END:
It is not hard at all.
You can also just clone this into your /.emacs.d/ directory.

#+begin_example
  `git clone https://github.com/erica-linag/ericas-emacs.git ~/.emacs.d`
#+end_example

It is only necessary to run emacs after that.  There are scripts
which can be run for automation if desired.


*** The Appearance

The appearance is largely controlled in *config/appearance.el*. If you need
to adjust the font size or other things that is where you will find them.

The theme can be changed below, in /init.el/.

*** The Makefile

Emacsn took all the responsibilities away from this Makefile.
Using Emacsn or git clone into /emacs.d/ is all that is required.

The only thing left is the sample /.mbsyncrc/ file.

Just running =make= will copy it to your home directory.

#+begin_src makefile :tangle ./Makefile

# get an example mbsync rc
.PHONY: mbsync
mbsync:
	cp mbsyncrc ~/.mbsyncrc

all: mbsync
#+end_src

** The big things;
:PROPERTIES:
:CUSTOM_ID: the-big-things
:END:
I've switched to using [[https://github.com/protesilaos/modus-themes][Modus themes.]] It is so nice to have a nice new style.
I've used some form of vi emulation in emacs since version 17.
I currently use [[https://github.com/emacs-evil/evil][Evil-mode for that]]. I've used [[https://www.emacswiki.org/emacs/mu4e][Mu4e]] as my mail client for years. It's still
the best.  I have [[https://github.com/abo-abo/hydra][Lots of Hydras.]] I love them for how easily they create usable interface
to something new. They are available on evil-leader *,* or *SPC.*

I use  [[https://github.com/minad/vertico][Vertico]] and  [[https://github.com/tumashu/posframe][PosFrame]] for most of completing functions I use, I used
helm the year or two before that, ivy, ido, smex, for years before that.
Obviously I'm using  [[https://orgmode.org/][Org]], but consider myself a forever noob. Time clocking,
invoicing and notes brought me to Org, now it is invading my life.

I am writing a book in org.  I maintain 4 websites in org.

I do have some nice code that allows me to create org articles for jekyll from
sub-trees. Which is really nice way to publish to a website.

[[https://github.com/emacs-dashboard/emacs-dashboard][Dashboard]] was one of those things that I was surprised to like.   But I dont
think of it as a splash screen, I'm beginning to think of it as central command,
and that appeals to me, I want to add more. [[https://www.emacswiki.org/emacs/UndoTree][Undo-tree]] is the coolest undo ever, have to have it.
I'm still learning [[https://github.com/magnars/multiple-cursors.el][multiple cursors]] I'm more used to the vi macro way of thinking.
I've recently been using [[https://github.com/ch11ng/exwm][ Exwm]] as my window manager and [[https://github.com/nex3/perspective-el][Perspective]] to manage how
I navigate projects, tasks, buffers and windows.

I use either *QuteBrowser* or *Vimb* as my browsers and dont spend much time in them.
I'm starting to use Eww more, so Ill have to adjust for that. I really cant decide which to use
Vimb has a more difficult learning curve.  Eww is nice for stuff I want to read.

I like learning languages also. I am a native english speaker and I speak French fluently.
I use utilities like [[https://languagetool.org][Language Tool]], [[https://hunspell.github.io][hunspell dictionaries]], [[https://orgmode.org/worg/org-contrib/org-drill.html][org-drill]], google-translate,
alternative input methods and anything else I can find that will make the multilingual
learning experience better. I'm looking to add wordnik.el. Currently learning Italian.

For music I have been migrating to [[https://www.gnu.org/software/emms/][Emms]] from Jriver media center and have to decided
to develop the things I need in a player around it.  I have also begun re-exploring [[http://lilypond.org][lilypond]] for writing
music, emacs has a nice lilypond mode.

I came to Emacs as an experienced progammer. I program lots of languages,
these are the main ones. They may or may not have extended configurations from default.

- Coding
  - Elisp
  - C, C++
  - Clojure
  - Clojure script
  - Python
  - Haskell
  - Lisps - Scheme, Guile, Racket, etc.
  - markdown
  - js
  - java
  - lua
  - shell
  - awk, sed, etc.

I tend to use Emacs for everything, so beyond writing code there is all of this.

- Creative writing
- Org publishing,
  - Websites
    - org/jekyll
  - pdf
- Natural Language learning.
- Organization
- Scheduling.
- Email
- Music player, librarian.
- File manager
- Window Manager

** My package list

I keep a master package list. That is all it is. No use-package. Using vanilla
Emacs packages works with this list. Any time I install a package I wish to keep
I add it here.  Sometimes it gets a /*-conf.el/ in the /config/ directory.

From the list, I can then have update and install functions that I can use to
ensure everything is installed and up to date.

This package list is automatically tangled into early-packages/mypackages.el/.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
    ;;; mypackages --- A list of all the packages to keep installed.
    ;;; Commentary:
    ;; All my packages, easy to install and update.
    ;; Provides two functions, one for install, one for update.
    ;;; Code:

#+end_src

If you are new to emacs you can read about any package with C-h P.

*** UI sort of things.
Just some basic stuff for the user interface.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
 (defvar my/packages
  '(golden-ratio
   general
   projectile
   perspective
   find-file-in-project
   dashboard
   windower
   expand-region
   dmenu
   async
   nov
#+end_src

*** Completers, ivy, helm, vertico, ...

Choose: ido/smex or ivy/swiper/counsel or helm or vertico.

I've used pretty much all the helpers over the years, ivy, ido, smex,
helm, vertico. Currently using vertico with posframe. Configurations are
still there for the others.  I find vertico not quite as nice as helm with ag, I should
see about fixing my ag interface.

**** Vertico
#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  vertico
  marginalia
  orderless
  consult
  embark
  embark-consult
#+end_src

**** Posframe

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  posframe
  vertico-posframe
  helm-posframe
  transient-posframe
  which-key-posframe
#+end_src

**** ido, smex

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;;ido ido-flx ido-imenu
  smex
#+end_src

**** Helm

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;; helm - an experiment in progess...
  helm
  helm-projectile
  helm-fish-completion
  helm-evil-markers
  helm-descbinds
  helm-swoop
  helm-org
  helm-cider
  cljr-helm

  helm-ag
  helm-sly
  helm-clojuredocs

  ;; hydra -- A lot to think about here...
  ;; https://github.com/abo-abo/hydra/wiki/Hydras-by-Topic
  ;; have to bind them, and try them, and make some.
  ;; maybe evil-leader stuff can just pop over.
  ;; maybe a few at first, that I use all the time.
  ;; ,fqgbsiaw   hmmm. don't know it's necessary...
  hydra pretty-hydra cider-hydra major-mode-hydra

  dash dash-functional
#+end_src

*** Emms Music player

I am a tango teacher and DJ I have suddenly switched over to emms.
I worked on the now defunct Songbird/Nightingale music player and I
would like to bring those features that I wrote forward to Emms in Emacs.

My Emms configuration is working with the Music Player Daemon.
I copy the mpd directory in this repo into my music directory and then link
the user default configuration file, =~./.config/mpd/mpd.conf= to the =mpd.conf= file there.

I have a perspective for Emms in my perspective hydra, available from =SPC=.
It will create an Emms perspective, start mpd, connect to mpd and start the browser and the playlist
and brings up README.org in the Music folder.

I also have a small Emms hydra attached to 'h' in the browser and playlist modes.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  emms
  emms-info-mediainfo
  emms-mark-ext
  emms-soundcloud
  helm-emms
  org-emms
#+end_src

I use dired as my file manager. I like for it to look nice.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  diff-hl ;; has a dired mode.

  all-the-icons
  all-the-icons-dired
  all-the-icons-completion
  all-the-icons-ibuffer

  diredfl
  dired-rsync
  fd-dired
  ranger

  ;; modeline
  ;; smart-mode-line rich-minority
  doom-modeline ;; the doom modeline

  ibuffer-projectile
  ibuffer-tramp
  ibuffer-git
#+end_src

*** Languages, translation

This is an active and changing portion of my Emacs at the moment.

I have been studying French for the last few years. I am now studying
Italian also. I am working on replacing Anki with Org drill in my routine.

I can also see that I'll probably want to add another language or two in
the future. I have a nice function to switch between input methods and
dictionaries. Ispell, flyspell, and hunspell are all working together
for spell checking. Google translate is there for highlighted text,
current word, or sentence at point and Language Tool is there to check
grammar. Take a look at the language sub-menu in /evil-leader-conf.el/
even if you are going to turn off evil-mode. Check out
/elisp/extensions/language.el/ and /elisp/config/lang-config.el/ and
/google-translate-conf.el/


#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;; Multi-language support
  google-translate
  langtool
  mw-thesaurus
  powerthesaurus

#+end_src

*** Navigation, jump, misc.

Jumping, with Ace, which-key, el-get.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;;navigation
  ace-jump-mode ace-window frog-jump-buffer ace-jump-buffer
  ;; basic tools
  which-key
  session
#+end_src

*** Exwm - The Emacs window manager.

After years of using Xmonad I find Exwm quite pleasant, and it is a very
seamless experience to let emacs do the few things I've used Xmonad for.
It has simplified my workflow and even simplified how I use Xmonad.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  exwm
  helm-exwm
  exwm-mff
  perspective-exwm
#+end_src

*** Shell

I use eshell when I'm not in Urxvt.  Its strange, but cool.
multi-term used to be pretty good, trying vterm.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;; eshell
  eshell-autojump
  fish-completion

  multi-term
  vterm
#+end_src

*** Evil, VI emulation

I've been using emacs in some sort of Vi emulation since 1995. Evil-mode
is, IMHO the best vi emulator so far. Although neovim is doing a really
good job. vimscript is an unfortunate language. You can easily turn it
off in /setup.el/ . The Evil mode setup includes a few but not all of
the Evil-mode extensions. For more information check out the
[[http://www.emacswiki.org/emacs/Evil][Evil-mode documentation.]]


#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;; evil-mode
  evil
  evil-nerd-commenter
  evil-leader
  evil-mu4e
  evil-org

#+end_src

*** Parenthesis

Parenthesis are important. paredit, smart-parens, lispy, ????

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;; Parentheses.
  evil-surround
  highlight-parentheses
  ;; paredit evil-paredit
  smartparens evil-smartparens evil-cleverparens
  ;; lispy lispyville ;; -- not a fan.
  rainbow-mode
  mic-paren
#+end_src

