early-packages/mypackages.el
    ;;; mypackages --- A list of all the packages to keep installed.
    ;;; Commentary:
;; All my packages, easy to install and update.
;; Provides two functions, one for install, one for update.
    ;;; Code:

(defvar my/packages
  '(golden-ratio
    general
    projectile
    perspective
    find-file-in-project
    dashboard
    windower
    expand-region
    dmenu
    async
    nov

    vertico
    ;;vertico-directory
    marginalia
    orderless
    consult
    embark
    embark-consult
    cape
    corfu
    corfu-terminal

    posframe
    vertico-posframe
    helm-posframe
    transient-posframe
    which-key-posframe

    ;;ido ido-flx ido-imenu
    smex

    ;; helm - an experiment in progess...
    helm
    helm-projectile
    helm-fish-completion
    helm-evil-markers
    helm-descbinds
    helm-swoop
    helm-org
    helm-cider
    cljr-helm

    helm-ag
    helm-sly
    helm-clojuredocs

    ;; hydra -- A lot to think about here...
    ;; https://github.com/abo-abo/hydra/wiki/Hydras-by-Topic
    ;; have to bind them, and try them, and make some.
    ;; maybe evil-leader stuff can just pop over.
    ;; maybe a few at first, that I use all the time.
    ;; ,fqgbsiaw   hmmm. don't know it's necessary...
    hydra pretty-hydra cider-hydra major-mode-hydra

    dash dash-functional

    emms
    emms-info-mediainfo
    emms-mark-ext
    ;; emms-player-simple-mpv
    emms-soundcloud
    ;; emms-state
    helm-emms
    org-emms

    diff-hl ;; has a dired mode.

    all-the-icons
    all-the-icons-dired
    all-the-icons-completion
    all-the-icons-ibuffer

    diredfl
    dired-rsync
    fd-dired
    ranger

    ;; modeline
    ;; smart-mode-line rich-minority
    doom-modeline ;; the doom modeline

    ibuffer-projectile
    ibuffer-tramp
    ibuffer-git

    ;; Multi-language support
    google-translate
    langtool
    mw-thesaurus
    powerthesaurus

    ;;navigation
    ace-jump-mode ace-window frog-jump-buffer ace-jump-buffer
    ;; basic tools
    which-key
    session

    exwm
    helm-exwm
    exwm-mff
    perspective-exwm

    ;; eshell
    eshell-autojump
    fish-completion

    multi-term
    vterm

    ;; evil-mode
    evil
    evil-nerd-commenter
    evil-leader
    evil-mu4e
    evil-org

    ;; Parentheses.
    evil-surround
    highlight-parentheses
    ;; paredit evil-paredit
    smartparens evil-smartparens evil-cleverparens
    ;; lispy lispyville ;; -- not a fan.
    rainbow-mode
    mic-paren

    ;; git
