README.org
*** Coding support

Coding requires a lot of various and never ending tools.
Heres mine.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;; git
  magit git-gutter
  el-get
  gited

  ;;coding support
  restclient
  restclient-helm

  eldoc
  auto-compile
  company
  origami
  undo-tree
  flycheck-tip
  kibit-helper
  flycheck-pos-tip
  aggressive-indent

  ;; Silver Surfer, grep, ctags.
  ag wgrep wgrep-ag ctags-update

  ;;extras
  ;;treemacs treemacs-evil treemacs-magit treemacs-projectile
  expand-region floobits
  gist
  exec-path-from-shell

#+end_src

**** Clojure, Cider, etc.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;; clojure -- need to rexamine this. lots of newer stuff.
  cider clj-refactor ac-cider
  cider-eval-sexp-fu
  clojure-mode eval-sexp-fu clojure-mode-extra-font-locking ;popup
  uuid rainbow-delimiters flycheck-clojure
  cider-hydra
  flycheck-clj-kondo
  4clojure

  ;; clojure script
  cljsbuild-mode smartscan

#+end_src

**** LSP-mode

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  lsp-mode
  lsp-treemacs
  lsp-ui

#+end_src

*** Coding languages

Programming language modes that I'm likely to use. I need to give some
attention to C, I spend a lot of time there and it is neglected.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  lua-mode
  company-lua
  ruby-mode
  hy-mode

  json-mode
  markdown-mode
  yaml-mode
  apache-mode

  ;;Shell
  company-shell

  ;;C/C++
  ;; Not sure, need to pursue a better C/C++ setup
  ;;irony company-irony company-ctags helm-etags ;company-rtags

  ;;haskell
  haskell-mode
  ;;ghc
  haskell-snippets
  dante ;; GHCi
  ;;helm-ghc
  flycheck-haskell

  ;;scheme/common lisp
  geiser
  sly
  flycheck-guile
  buttercup

  ;;Python
  elpy
  pyenv-mode ein
  python-docstring
  py-autopep8
  py-yapf pydoc
  python-black

#+end_src

*** Org

Still exploring these of course. Org is never ending just like Emacs.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;;org mode.
  org
  org-roam
  org-ref
  org-ref-prettify
  org-auto-tangle
  org-roam-timestamps
  org-roam-bibtex
  org-rich-yank
  org-pretty-tags
  org-babel-eval-in-repl
  org-bullets
  visual-fill-column
  org-cliplink
  org-drill
  org-drill-table
  ox-gfm

#+end_src

*** Emacs Applications

I tried slack, not too happy with it. I do like Eww as a browser
for somethings, and Ive been looking at discord and telegram.
On Verra

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;;slack - hasn't worked very well so far..
  slack
  oauth2
  alert
  emojify
  ;;helm-slack
#+end_src

*** Aesthetics

These are just some themes. If you need to change something it is probably in
*config/appearance-conf.el*.

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;; themes
  modus-themes
  doom-themes
  monokai-theme monokai-alt-theme obsidian-theme atom-dark-theme
  bubbleberry-theme atom-one-dark-theme
  ujelly-theme twilight-theme
  tango-2-theme tango-plus-theme tangotango-theme zenburn-theme
  waher-theme underwater-theme toxi-theme sublime-themes
  subatomic-theme sunny-day-theme subatomic256-theme
  soft-stone-theme soft-morning-theme purple-haze-theme
  noctilux-theme naquadah-theme leuven-theme lavender-theme
  light-soap-theme ir-black-theme inkpot-theme heroku-theme
  github-theme gandalf-theme flatland-theme firecode-theme
  flatui-theme espresso-theme django-theme darkmine-theme
  darcula-theme oldlace-theme cyberpunk-theme clues-theme
  busybee-theme boron-theme bliss-theme
  ample-zen-theme ample-theme lush-theme smyx-theme gotham-theme
  solarized-theme dark-krystal-theme))

#+end_src

** Package install and update functions

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el
  ;;
  ;; Install stuff from packages.

  (defun early-install-mypackages ()
    "Install a theme and any other early things."
    (dolist (pkg '(modus-themes))
      (unless (package-installed-p pkg))
      (package-install pkg)))

  (defun install-mypackages ()
    "Install my/packages if they arent already."
    (dolist (pkg my/packages)
      (unless (package-installed-p pkg))
      (package-install pkg)))

  (defun update-mypackages ()
    "Update my/packages if they need it."
    (interactive)
    (dolist (pkg my/packages)
      (package-install pkg)))
#+end_src

Thats all the packages and how I manage them.

** Set up the package archives

#+begin_src emacs-lisp :tangle ./early-packages/mypackages.el

  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
  (add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/"))
  ;;(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)

  (package-initialize)
  (when (not package-archive-contents)
    (package-refresh-contents))

  ;; let this be controlled elsewhere.
  ;;(install-mypackages)
  ;;(update-mypackages)

  (provide 'mypackages)
  ;;; mypackages.el ends here (emacs-lisp-checkdoc)
#+end_src

** Init.el and the rest
:PROPERTIES:
:CUSTOM_ID: key-files
:END:

*** init.el - The beginning.
Set up the load paths.  Turn off cl-function warnings.
Point custom to ~/.config/emacs-custom.el.

**** The load path

- *early-packages/*, is just the packages and hints.
- *extensions/* are custom elisp code.
- *config/* is for all of the package configurations.
- *themes/* is for all of the package configurations.

#+begin_src emacs-lisp :tangle ./init.el
  ;;; init.el --- init.el for Ericas-Emacs
  ;;; Commentary:
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Set the loadpath / bytecompile everything - Go -- Eric
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ;; Code:
  ;; cl is obsolete, cl-lib is the replacement
  ;; Lots of current packages still use cl.
  ;; this gets rid of the warning everytime emacs starts.
  (setq byte-compile-warnings '(cl-functions))

  (setq load-path
        (append (list
                 (expand-file-name "./early-packages" user-emacs-directory)
                 (expand-file-name "./themes" user-emacs-directory)
                 (expand-file-name "./extensions" user-emacs-directory)
                 (expand-file-name "./config" user-emacs-directory))
                load-path))

  (setq custom-file "~/.config/emacs-custom.el")
  (load custom-file)
  #+end_src

**** The org and windmove clash
Org likes to take over the arrow keys. I kind of miss them, hydras help.

  #+begin_src emacs-lisp :tangle ./init.el
  ;; so org doesn't step on the S-Arrow keys from windmove.
  (setq org-replace-disputed-keys t)
  #+end_src

**** Load just enough to get a theme
Load my packages and then install enough to get a theme.

  #+begin_src emacs-lisp :tangle ./init.el
  (load "mypackages")
  (early-install-mypackages) ; make sure we have a theme
  #+end_src

**** Load the Modus theme
 Load up the Theme so we don't have to look at that stark white gnu screen
 if it takes a minute to install.

  #+begin_src emacs-lisp :tangle ./init.el
  ;; just so I dont have to look at Emacs default so long.
  (load "appearance")
  (load "themes-init")
  ;; this is a local theme I made. Code is in themes.
  ;; (load-theme 'strange-deeper-blue t)
  ;; (enable-theme 'strange-deeper-blue)
  (require 'modus-themes)
  #+end_src

**** Tweak the Modus theme

Tweak some Modus colors with different choices.

  #+begin_src emacs-lisp :tangle ./init.el
  ;; Faint yellow comments and a different shade of green for strings
  (setq modus-themes-common-palette-overrides
        '((string yellow-faint)
          (fringe unspecified)
          ;;(string green-warmer)
          (bg-region bg-lavender) ; try `bg-ochre' `bg-lavender', `bg-sage'
          (fg-region unspecified)
          (bg-paren-match bg-magenta-intense)
          (underline-paren-match fg-main)))
  (setq modus-themes-bold-constructs t
        modus-themes-italic-constructs t
        modus-themes-prompts '(intense-bold)
        modus-themes-completions 'intense-bold
        modus-themes-org-blocks 'tinted-background)

  (load-theme 'modus-vivendi-tinted t)             ; Dark theme
  #+end_src

**** load all the packages.

This loads the list from /mypackages/.  Install only cares if it is or not.
update will check everyone and make sure it is as new as possible.

  #+begin_src emacs-lisp :tangle ./init.el
  ;; Now we get to load our packages.
  (update-mypackages)
  ;;(install-mypackages) ; make sure, if it just starts up that it will
  #+end_src

**** Load everything else.

Load up the extensions, configurations and themes.

  #+begin_src emacs-lisp :tangle ./init.el
    ;; load up everything, compiling as needed.
    ;; still the simplest, even though just load could
    ;; work if auto compile was on for loading and saving..
    ;; theoretically, if everything was just right.
    ;; takes the same amount of time either way.

    ;; conditionally recompile and load these dirs.
    (require 'bytecompiledir)
    (byte-compile-directory (expand-file-name "./extensions" user-emacs-directory))
    (byte-compile-directory (expand-file-name "./config" user-emacs-directory))
    (byte-compile-directory (expand-file-name "./themes" user-emacs-directory))

    (load "display_hints") ; advice for various buffers.
  #+end_src

