README.org
**** Turn some stuff on.

Evil mode, highlight line, golden ratio, visible bell, etc.

  #+begin_src emacs-lisp :tangle ./init.el

    ;;; Some global modes
    ;;; Turn on Vi mode.
    (evil-mode t)

    ;;; line highlight
    (global-hl-line-mode 1)

    ;;; Great for smaller screens. or bigger ones...
    (golden-ratio-mode)

    (setq visible-bell 1)

    ;; windmove navigation
    (windmove-default-keybindings)         ; shifted arrow keys
    (setq windmove-wrap-around t)

    (provide 'init)
    ;;; init.el ends here
#+end_src

*** Other Key Files

- config/ - Folder where all the real setup goes.

- extensions/ - Folder where non-elpa custom code goes.

- extensions/hydras.el - All the hydras

- config/vars.el - miscellaneous variable setting.

- config/keys.el - key bindings, mostly F keys.

- config/general-conf.el - key bindings for *SPC*.

- config/evil-leader.el - more key bindings, vi style.

** Mu4e - Mail
:PROPERTIES:
:CUSTOM_ID: mu4e---mail
:END:
I use Mu4e and isync for email. I can't imagine a better email client.
There is a reasonably basic mu4e configuration with multiple contexts.
There is a sample mbsyncrc file that can be used to configure
/isync/mbsync/.

=make mbsync= will copy a sample /.mbsyncrc/ to your home directory.

This is a bit easier now than it used to be. Arch Linux seems to install
/mu4e/ properly when /mu/ is installed with pacman.

I cannot speak about other distributions or OS'.

** Key mappings
:PROPERTIES:
:CUSTOM_ID: key-mappings
:END:
I have been switching over to General, I now have a *Space* key that is
the entry to point to the most used things and hydras. It has a lot of
overlap with my evil-leader menus.  I am slowly centralizing on General.

Its all up in the air as I am rearranging my Emacs UI at the moment.

I have an extensive menu system on Evil-leader which allows for *,w* for
write, *,q* delete-buffer, etc. the entire Hydra subsystem is available
at *,h*.

I use /which-key-posframe/ which is almost like hydra with all the
submenus. The only thing about posframe is that it seems to behave
badly in terminal mode. It just turns off instead of falling back to something
reasonable. I should just turn it off in the config when in terminal mode.

Mostly, the key mappings I added are non-intrusive. It is definitely a
good idea to go read /config/evil-leader-conf.el/ whether you want
/Evil/ key bindings or not. It will give you a good idea of
functionality to look for or map to your own keys in /keys.el/

** Additional software needed
:PROPERTIES:
:CUSTOM_ID: additional-packages-needed
:END:

I use isync/mbsync to retrieve mail, mu for indexes and mu4e as my email client.

I use language tool and hunspell for grammar and spelling. And finally I use the
Iosevka fonts.  I tend to use *ag* ie. The Silver searcher,  or a similar tool like *ripgrep*
will be needed.

Everything you really need, on Arch Linux, is this plus some hunspell dictionaries.

=yay -S mu isync languagetool hunspell ttf-iosevka ttc-iosevka the_silver_searcher=

Arch Linux has a lot of dictionaries, Just do =pacman -Ss hunspell= to see what is there.

*** Searching
- I use *ag*,  the silver searcher a lot.   =yay -S silver_searcher_searcher=
*** EMail
  - mu-git - on Arch linux
    - [[https://www.djcbsoftware.nl/code/mu/mu4e/Installation.html#Installation][install mu/mu-git/mu4e]] or maybe just do a =yay -S mu-git=.
  - isync (mbsync) - =yay -S isync=
  - =make mbsync= to copy a sample /.mbsyncrc/ for use with /isync/ to
    your home directory. Additional isync/mbsync/mu4e resources [[http://www.ict4g.net/adolfo/notes/2014/12/27/EmacsIMAP.html][are here:]]
*** Spelling and grammar.
  - languagetool
  - hunspell -- add dictionaries as needed.
  - hunspell dictionaries, I also have  [[https://github.com/EricGebhart/Hunspell-dictionaries][them here]]
*** Fonts
- Fonts /Iosevka Fonts/ [[https://github.com/be5invis/Iosevka][are here!]] Or just install the Arch Linux packages. One is community, the
  other AUR. =yay -S ttf-iosevka ttc-iosevka=

** Themes
:PROPERTIES:
:CUSTOM_ID: themes
:END:
I am using Modus Themes now. There are lots of other themes here, but
I'm tempted to remove all but my custom palette-theme extensions. Themes are
frequently are deleted from elpa and cause trouble during install with
package not found errors. The name must then be removed from
/mypackages.el/.

There Lots of themes from packages which is ironic considering I used the same theme
for 26 years and only recently switched from my own personal theme
strange-deeper-blue.

*** Palette themes
I also wrote a palette-themes.el which is a more general library
adapted from the solarized-theme. Palette-themes allow for the creation
of themes simply by defining a palette of colors. There are four
different variations of the solarized themes included.

** Install and update scripts/functions

This Emacs uses packages, so if that is all you want, read no further.

The packages of this Emacs configuration can be easily installed or
updated with a couple of commands. They can also  be
updated from outside of Emacs which makes it easier to
manage them.

*** Within Emacs
To use the package list for an update or an install is a
little bit nicer than =list-packages U x q=

=M-x install-mypackages=
or
=M-x update-mypackages=

*** Outside of Emacs

These are just to make sure things are current with git and all the Emacs
packages are installed and up to date. These commands are used by
*Emacsn* to manage Ericas-Emacs. Emacsn takes care of all of this for you.

The following scripts can be run to either install or update all of the
packages. The only difference is that install ignores packages that are
already installed. I think it makes very little difference in load time.
The update script adds a =git pull origin= before looking for
updates.

The nice thing about these is they run from the command line and are
done. They will also work just fine with a fresh vanilla install. The
caveat is they need --chdir, or to be in their proper folder upon
execution. Wherever this is installed is where /--chdir/ should be and
where the scripts live.

If they are in ~/.emacs.d/, then these would work.

#+begin_example
  `emacs --script install.el --chdir ~/.emacs.d`
  or
  `emacs --script update.el  --chdir ~/.emacs.d`

#+end_example

These are mostly for convenience, they can be called by a vanilla emacs from outside
of the install.  This is how *Emacsn* initializes and updates this distribution.
The update does also do a /git pull origin/ to checkout the latest version of it's self.

**** install.el

This is a simple script, with some user directory manipulation to fool emacs.
We make the current working directory the user directory.
Then we load the package list, and install them. Its just a little bit of what init.el does.

It is important to either invoke emacs where this script is, or to use the /--chdir/ option
to move emacs there.

#+begin_src emacs-lisp :tangle ./install.el
;;; install --- Installs packages for the first time.

;;; Commentary:
;;; Give a script to run to install all the packages the first time.
;;; Skips packages that are already installed.

;;; This will only work if run from the directory it is in.
;;; We change the user-emacs-directory to here so that Emacs will install
;;; its packages here.

;;; Install only looks for missing packages.  It does not check for upgrades.


;;; Code:

;;; Because when we get here, emacs is still pointing at its .emacs.d and we
;;; need it to point here. I'm not yet sure why it doesn't point here.
;;; chemacs must not set it when we use --script which means we can
;;; just run this with vanilla emacs and fool it to point here so
;;; our packages get installed.

;; trick emacs to be here, instead of it's .emacs.d
(setq user-emacs-directory default-directory)
(setq package-user-dir (expand-file-name "elpa" user-emacs-directory))

;; this is all we need. We just want to install all the packages.
(setq load-path
      (append (list
               (expand-file-name "./early-packages" user-emacs-directory)
	       )
	      load-path))

(load "mypackages")

(install-mypackages)

(provide 'install)
;;; install.el ends here
#+end_src

**** update.el

We make the current working directory the user directory.
We do a =git pull origin=.
Then we update or install all of the packages that need it.

It is important to either invoke emacs where this script is, or to use the /--chdir/ option
to move emacs there.

#+begin_src emacs-lisp :tangle ./update.el
;;; update --- Update packages, install missing packages.

;;; Commentary:
;;; Give a script to run to install all the packages the first time.
;;; This will only work if run from the directory it is in.
;;; We change the user-emacs-directory to here so that Emacs will install
;;; its packages here.

;;; The only difference between this and install.el is that install only looks
;;; for missing packages.  If they are installed it doesn't touch them.
;;; This takes a little more time, but checks to see if anything needs updating.
;;; install is faster if repeating an install step because of problems.


;;; Code:

;;; Because when we get here, emacs is still pointing at ~/.emacs.d and we
;;; need it to point here. I'm not yet sure why it doesn't point here.
;;; chemacs must not set it when we use --script which means we can
;;; just run this with vanilla emacs and fool it to point here so
;;; our packages get installed.

(shell-command "git pull origin main")

;; Trick emacs to be here, instead of .emacs.d
;; Requires being here or using emacs --chdir <here> to work.
(setq user-emacs-directory default-directory)
(setq package-user-dir (expand-file-name "elpa" user-emacs-directory))

(setq load-path
      (append (list
               (expand-file-name "./early-packages" user-emacs-directory)
	       )
	      load-path))

(load "mypackages")
(update-mypackages)

(provide 'update)
;;; update.el ends here
#+end_src

** Display Hints

Some ancient display hints I should probably revisit.

#+begin-src emacs-elisp :tangle early-packages/display-hints.el
;; set the initial frame size
;;(setq initial-frame-alist '((top . 20) (left . 0) (width . 200) (height . 60)))

;;Display-Buffer-Alist controls window display choices.
                                        ; display buffer alist is not really working in 24.3 as far
                                        ; as I can tell. some settings do work, but not all. Waiting for 24.4
                                        ; there is a window test function in functions to play with this.
                                        ; setting to nil at the end.

(add-to-list 'display-buffer-alist
             '("\\*.*\\*"
               (display-buffer-pop-up-window
                )
               (reusable-frames)
               (window-height . 5)))

(add-to-list 'display-buffer-alist
             '("\\*shell\\*"
               (
                display-buffer-in-previous-window
                display-buffer-below-selected
                )
               (reusable-frames)
               (window-height . 15)
               (window-width . 60)))

(add-to-list 'display-buffer-alist
             '("\\*help\\*"
               (
                display-buffer-reuse-window
                display-buffer-in-previous-window
                display-buffer-below-selected
                display-buffer-pop-up-window)
               (reusable-frames)
               (window-height . 20)))

(add-to-list 'display-buffer-alist
             '("\\*cider\\*"
               (
                display-buffer-below-selected
                display-buffer-reuse-window
                display-buffer-in-previous-window
                display-buffer-pop-up-window )
               (reusable-frames)
               (window-height . 20)))

(setq display-buffer-alist nil)
(setq checkdoc-arguments-in-order-flag nil)
#+end-src
