init.el

;;; Some global modes
;;; Turn on Vi mode.
(evil-mode t)

;;; line highlight
(global-hl-line-mode 1)

;;; Great for smaller screens. or bigger ones...
(golden-ratio-mode)

(setq visible-bell 1)

;; windmove navigation
(windmove-default-keybindings)         ; shifted arrow keys
(setq windmove-wrap-around t)

(provide 'init)
;;; init.el ends here
